; ModuleID = 'pc1.c'
source_filename = "pc1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@cle = dso_local global [32 x i8] zeroinitializer, align 16, !dbg !0
@x1a0 = dso_local global [16 x i16] zeroinitializer, align 16, !dbg !46
@res = dso_local global i16 0, align 2, !dbg !51
@inter = dso_local global i16 0, align 2, !dbg !55
@i = dso_local global i16 0, align 2, !dbg !53
@x1a2 = dso_local global i16 0, align 2, !dbg !44
@dx = dso_local global i16 0, align 2, !dbg !38
@ax = dso_local global i16 0, align 2, !dbg !31
@cx = dso_local global i16 0, align 2, !dbg !36
@bx = dso_local global i16 0, align 2, !dbg !34
@tmp = dso_local global i16 0, align 2, !dbg !42
@si = dso_local global i16 0, align 2, !dbg !40
@.str = private unnamed_addr constant [33 x i8] c"abcdefghijklmnopqrstuvwxyz012345\00", align 1, !dbg !5
@buff = dso_local global [32 x i8] zeroinitializer, align 16, !dbg !63
@count = dso_local global i32 0, align 4, !dbg !75
@c1 = dso_local global i32 0, align 4, !dbg !72
@c = dso_local global i16 0, align 2, !dbg !69
@cfc = dso_local global i16 0, align 2, !dbg !57
@cfd = dso_local global i16 0, align 2, !dbg !59
@compte = dso_local global i16 0, align 2, !dbg !61
@d = dso_local global i16 0, align 2, !dbg !77
@e = dso_local global i16 0, align 2, !dbg !79
@.str.1 = private unnamed_addr constant [10 x i8] c"argc < 1\0A\00", align 1, !dbg !11

!22 = distinct !DIGlobalVariable(scope: null, file: !3, line: 329, type: !23, isLocal: true, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 56, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 7)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(scope: null, file: !3, line: 331, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 2)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "ax", scope: !2, file: !3, line: 4, type: !33, isLocal: false, isDefinition: true)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "bx", scope: !2, file: !3, line: 4, type: !33, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "cx", scope: !2, file: !3, line: 4, type: !33, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "dx", scope: !2, file: !3, line: 4, type: !33, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "si", scope: !2, file: !3, line: 4, type: !33, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "tmp", scope: !2, file: !3, line: 4, type: !33, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "x1a2", scope: !2, file: !3, line: 4, type: !33, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "x1a0", scope: !2, file: !3, line: 4, type: !48, isLocal: false, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 256, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 16)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "res", scope: !2, file: !3, line: 4, type: !33, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "i", scope: !2, file: !3, line: 4, type: !33, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "inter", scope: !2, file: !3, line: 5, type: !33, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "cfc", scope: !2, file: !3, line: 5, type: !33, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "cfd", scope: !2, file: !3, line: 5, type: !33, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "compte", scope: !2, file: !3, line: 5, type: !33, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "buff", scope: !2, file: !3, line: 10, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 256, elements: !67)
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !{!68}
!68 = !DISubrange(count: 32)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "c", scope: !2, file: !3, line: 12, type: !71, isLocal: false, isDefinition: true)
!71 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "c1", scope: !2, file: !3, line: 14, type: !74, isLocal: false, isDefinition: true)
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "count", scope: !2, file: !3, line: 14, type: !74, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "d", scope: !2, file: !3, line: 16, type: !71, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "e", scope: !2, file: !3, line: 16, type: !71, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "in", scope: !2, file: !3, line: 18, type: !83, isLocal: false, isDefinition: true)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !85, line: 7, baseType: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !87, line: 49, size: 1728, elements: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!88 = !{!89, !90, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !105, !107, !108, !109, !113, !114, !116, !120, !123, !125, !128, !131, !132, !134, !138, !139}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !86, file: !87, line: 51, baseType: !74, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !86, file: !87, line: 54, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !86, file: !87, line: 55, baseType: !91, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !86, file: !87, line: 56, baseType: !91, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !86, file: !87, line: 57, baseType: !91, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !86, file: !87, line: 58, baseType: !91, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !86, file: !87, line: 59, baseType: !91, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !86, file: !87, line: 60, baseType: !91, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !86, file: !87, line: 61, baseType: !91, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !86, file: !87, line: 64, baseType: !91, size: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !86, file: !87, line: 65, baseType: !91, size: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !86, file: !87, line: 66, baseType: !91, size: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !86, file: !87, line: 68, baseType: !103, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !87, line: 36, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !86, file: !87, line: 70, baseType: !106, size: 64, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !86, file: !87, line: 72, baseType: !74, size: 32, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !86, file: !87, line: 73, baseType: !74, size: 32, offset: 928)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !86, file: !87, line: 74, baseType: !110, size: 64, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 152, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!112 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !86, file: !87, line: 77, baseType: !33, size: 16, offset: 1024)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !86, file: !87, line: 78, baseType: !115, size: 8, offset: 1040)
!115 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !86, file: !87, line: 79, baseType: !117, size: 8, offset: 1048)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 1)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !86, file: !87, line: 81, baseType: !121, size: 64, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !87, line: 43, baseType: null)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !86, file: !87, line: 89, baseType: !124, size: 64, offset: 1152)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 153, baseType: !112)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !86, file: !87, line: 91, baseType: !126, size: 64, offset: 1216)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !87, line: 37, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !86, file: !87, line: 92, baseType: !129, size: 64, offset: 1280)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !87, line: 38, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !86, file: !87, line: 93, baseType: !106, size: 64, offset: 1344)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !86, file: !87, line: 94, baseType: !133, size: 64, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !86, file: !87, line: 95, baseType: !135, size: 64, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !136, line: 46, baseType: !137)
!136 = !DIFile(filename: "/usr/lib/llvm-17/lib/clang/17/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "d1776268f398bd1ca997c840ad581432")
!137 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !86, file: !87, line: 96, baseType: !74, size: 32, offset: 1536)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !86, file: !87, line: 98, baseType: !140, size: 160, offset: 1568)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 20)
!143 = !{i32 7, !"Dwarf Version", i32 5}
!144 = !{i32 2, !"Debug Info Version", i32 3}
!145 = !{i32 1, !"wchar_size", i32 4}
!146 = !{i32 8, !"PIC Level", i32 2}
!147 = !{i32 7, !"PIE Level", i32 2}
!148 = !{i32 7, !"uwtable", i32 2}
!149 = !{i32 7, !"frame-pointer", i32 2}
!150 = !{!"Ubuntu clang version 17.0.6 (++20231209124227+6009708b4367-1~exp1~20231209124336.77)"}
!151 = distinct !DISubprogram(name: "assemble", scope: !3, file: !3, line: 22, type: !152, scopeLine: 23, spFlags: DISPFlagDefinition, unit: !2)
!152 = !DISubroutineType(types: !153)
!153 = !{!74}
!154 = !DILocation(line: 26, column: 14, scope: !151)
!155 = !DILocation(line: 26, column: 21, scope: !151)
!156 = !DILocation(line: 26, column: 30, scope: !151)
!157 = !DILocation(line: 26, column: 28, scope: !151)
!158 = !DILocation(line: 26, column: 13, scope: !151)
!159 = !DILocation(line: 26, column: 11, scope: !151)
!160 = !DILocation(line: 28, column: 3, scope: !151)
!161 = !DILocation(line: 30, column: 11, scope: !151)
!162 = !DILocation(line: 30, column: 9, scope: !151)
!163 = !DILocation(line: 33, column: 13, scope: !151)
!164 = !DILocation(line: 33, column: 25, scope: !151)
!165 = !DILocation(line: 33, column: 32, scope: !151)
!166 = !DILocation(line: 33, column: 41, scope: !151)
!167 = !DILocation(line: 33, column: 39, scope: !151)
!168 = !DILocation(line: 33, column: 21, scope: !151)
!169 = !DILocation(line: 33, column: 11, scope: !151)
!170 = !DILocation(line: 35, column: 3, scope: !151)
!171 = !DILocation(line: 37, column: 11, scope: !151)
!172 = !DILocation(line: 37, column: 19, scope: !151)
!173 = !DILocation(line: 37, column: 17, scope: !151)
!174 = !DILocation(line: 37, column: 9, scope: !151)
!175 = !DILocation(line: 40, column: 13, scope: !151)
!176 = !DILocation(line: 40, column: 25, scope: !151)
!177 = !DILocation(line: 40, column: 32, scope: !151)
!178 = !DILocation(line: 40, column: 41, scope: !151)
!179 = !DILocation(line: 40, column: 39, scope: !151)
!180 = !DILocation(line: 40, column: 21, scope: !151)
!181 = !DILocation(line: 40, column: 11, scope: !151)
!182 = !DILocation(line: 42, column: 3, scope: !151)
!183 = !DILocation(line: 44, column: 11, scope: !151)
!184 = !DILocation(line: 44, column: 19, scope: !151)
!185 = !DILocation(line: 44, column: 17, scope: !151)
!186 = !DILocation(line: 44, column: 9, scope: !151)
!187 = !DILocation(line: 47, column: 13, scope: !151)
!188 = !DILocation(line: 47, column: 25, scope: !151)
!189 = !DILocation(line: 47, column: 32, scope: !151)
!190 = !DILocation(line: 47, column: 41, scope: !151)
!191 = !DILocation(line: 47, column: 39, scope: !151)
!192 = !DILocation(line: 47, column: 21, scope: !151)
!193 = !DILocation(line: 47, column: 11, scope: !151)
!194 = !DILocation(line: 49, column: 3, scope: !151)
!195 = !DILocation(line: 51, column: 11, scope: !151)
!196 = !DILocation(line: 51, column: 19, scope: !151)
!197 = !DILocation(line: 51, column: 17, scope: !151)
!198 = !DILocation(line: 51, column: 9, scope: !151)
!199 = !DILocation(line: 54, column: 13, scope: !151)
!200 = !DILocation(line: 54, column: 25, scope: !151)
!201 = !DILocation(line: 54, column: 32, scope: !151)
!202 = !DILocation(line: 54, column: 41, scope: !151)
!203 = !DILocation(line: 54, column: 39, scope: !151)
!204 = !DILocation(line: 54, column: 21, scope: !151)
!205 = !DILocation(line: 54, column: 11, scope: !151)
!206 = !DILocation(line: 56, column: 3, scope: !151)
!207 = !DILocation(line: 58, column: 11, scope: !151)
!208 = !DILocation(line: 58, column: 19, scope: !151)
!209 = !DILocation(line: 58, column: 17, scope: !151)
!210 = !DILocation(line: 58, column: 9, scope: !151)
!211 = !DILocation(line: 61, column: 13, scope: !151)
!212 = !DILocation(line: 61, column: 25, scope: !151)
